{
    "2025": [
        {
            "subject": "presentation",
            "author": [
                "William PENSEC"
            ],
            "titre": "Enhanced Processor Defence Against Physical and Software Threats by Securing DIFT Against Fault Injection Attacks",
            "booktitle": "Séminaire de présentation des travaux de thèse",
            "acronyme": "Séminaire",
            "month": "January",
            "abstract": "",
            "doi": "",
            "location": "Montpellier",
            "publisher": "hal",
            "keywords": [
                "Hardware security",
                "Physical Attacks",
                "Fault injection simulation",
                "Countermeasures",
                "Vulnerability Assessment",
                "Dynamic Information Flow Tracking",
                "Error-Correcting Code",
                "Error-Detecting Code",
                "Embedded processor",
                "IoT","RISC-V"
            ]
        }
    ],
    "2024": [
        {
            "subject": "presentation",
            "author": [
                "William PENSEC"
            ],
            "titre": "Enhanced Processor Defence Against Physical and Software Threats by Securing DIFT Against Fault Injection Attacks",
            "booktitle": "Soutenance de thèse",
            "acronyme": "Soutenance",
            "month": "December",
            "abstract": "The expansion of the Internet of Things (IoT) in sectors such as healthcare and industry is concurrently increasing the attack surface and giving rise to significant security concerns. These systems, which process sensitive data, are susceptible to both software and physical attacks due to their network connectivity and proximity to potential attackers. Dynamic Information Flow Tracking (DIFT) is a method of detecting software attacks, such as malware, by tagging and analysing the data flow during the execution of a program. Fault injection attacks (FIAs) induce errors (for example, through the use of laser pulses) that disrupt the normal functioning of a system and bypass security mechanisms. FIAs are of particular importance in the context of embedded and cryptographic systems, where vulnerabilities can lead to the compromise of data. Despite the existence of numerous studies examining FIA vulnerabilities, none have focused on DIFT mechanisms. Our research is focused on the D-RI5CY processor, implementing an in-core hardware DIFT. The present study is concerned with evaluating the impact of FIAs on the effectiveness of DIFT. To this end, we have designed and developed FISSA, a tool for simulating fault injections at the RTL level. A set of FIA-sensitive registers was identified, and three protections were implemented and compared: single parity for detection, Hamming Code for single-bit error correction, and SECDED for double-bit error detection. The implementation of these protections was studied using different strategies, which were evaluated in terms of their impact on the area, and performance overhead and level of security facing different fault models.",
            "doi": "",
            "location": "Lorient",
            "publisher": "hal",
            "keywords": [
                "Hardware security",
                "Physical Attacks",
                "Fault injection simulation",
                "Countermeasures",
                "Vulnerability Assessment",
                "Dynamic Information Flow Tracking",
                "Error-Correcting Code",
                "Error-Detecting Code",
                "Embedded processor",
                "IoT","RISC-V"
            ]
        },
        {
            "subject": "poster",
            "author": [
                "William PENSEC",
                "Vianney LAPÔTRE",
                "Guy GOGNIAT"
            ],
            "titre": "Implementation and evaluation of countermeasures in a DIFT mechanism against Fault Injection Attacks",
            "booktitle": "Journée thématique sur les Attaques par Injection de Fautes",
            "acronyme": "JAIF",
            "month": "October",
            "abstract": "Nowadays, IoT devices face many threats and these systems, sometimes critical, need to be protected against both software and physical attacks. Software attacks can be detected using Dynamic Information Flow Tracking (DIFT) techniques.",
            "doi": "",
            "location": "Rennes",
            "publisher": "hal",
            "keywords": [
                "Hardware security",
                "Physical Attacks",
                "Fault injection simulation",
                "Countermeasures",
                "Vulnerability Assessment"
            ]
        },
        {
            "subject": "poster",
            "author": [
                "Kévin QUÉNÉHÉRVÉ",
                "William PENSEC",
                "Philippe TANGUY",
                "Rachid DAFALI",
                "Vianney LAPÔTRE"
            ],
            "titre": "Exploring Fault Injection Attacks on CVA6 PMP Configuration Flow",
            "booktitle": "Journée thématique sur les Attaques par Injection de Fautes",
            "acronyme": "JAIF",
            "month": "October",
            "abstract": "",
            "doi": "https://hal.science/hal-04729617",
            "location": "Rennes",
            "publisher": "hal",
            "keywords": [
                "Hardware security",
                "Fault Injection Attacks",
                "RISC-V",
                "Physical Memory Protection",
                "Hamming code",
                "FPGA"
            ]
        },
        {
            "subject": "paper",
            "author": [
                "William PENSEC",
                "Vianney LAPÔTRE",
                "Guy GOGNIAT"
            ],
            "titre": "Scripting the Unpredictable: Automate Fault Injection in CABA Simulation for Vulnerability Assessment",
            "booktitle": "Euromicro Conference on Digital System Design",
            "acronyme": "DSD 2024",
            "month": "August",
            "abstract": "This paper presents FISSA, an open-source software tool that facilitates the building of fault injection campaigns based on well-known HDL simulation tools. The proposed solution relies on two software modules that encapsulate an existing HDL simulator. The first module generates TCL scripts to drive the simulation process and automatically inject faults according to the user's needs. The second module is dedicated to fault analysis, enabling users to assess the resilience of their design. The proposed approach allows the designers to seamlessly integrate fault injection simulations into their workflow. To demonstrate the solution's capacity, this paper proposes a case study to evaluate the robustness of a Dynamic Information Flow Tracking mechanism integrated into a RISC-V processor against different fault injection scenarios. For that purpose, a total of 360,747 simulations have been performed.",
            "doi": "https://hal.science/hal-04683084",
            "location": "Paris",
            "publisher": "hal",
            "keywords": [
                "Hardware security",
                "Physical Attacks",
                "Fault injection simulation",
                "Open-Source tool",
                "Vulnerability Assessment"
            ]
        },
        {
            "subject": "paper",
            "author": [
                "Kévin QUÉNÉHÉRVÉ",
                "William PENSEC",
                "Philippe TANGUY",
                "Rachid DAFALI",
                "Vianney LAPÔTRE"
            ],
            "titre": "Exploring Fault Injection Attacks on CVA6 PMP Configuration Flow",
            "booktitle": "Euromicro Conference on Digital System Design",
            "acronyme": "DSD 2024",
            "month": "August",
            "abstract": "Fault Injection Attacks (FIA) pose significant threats to the security and reliability of embedded systems. FIAs can be used to target an embedded processor by manipulating its clock signal, power supply or by using electromagnetic pulses.In this study, we analyze FIA on the Physical Memory Protection (PMP) configuration flow of a CVA6 RISC-V core. Fault injection campaigns targeting an FPGA implementation on an ARTY A7-100T board are performed to characterize the fault effects. For that purpose, we rely on clock glitches. Moreover, in order to further characterize the induced faults, Error-Correction Code (ECC) is considered. We extend the ID pipeline stage with hardware modules to filter faults using Hamming code. Experimental results demonstrate that FIA has multiple effects on the PMP configuration registers. By classifying these effects in regards with injection parameters, we highlight that a given effect can be obtained with high probability by an attacker. Furthermore, thanks to integrated ECC modules used as filters, we confirm that single bit-flips is a prevalent effect in our experiments. Particularly, results demonstrate that numerous fault effects observed in the PMP configuration registers are caused by single bit-flips in the ID stage of the CVA6 core.",
            "doi": "https://hal.science/hal-04683083/",
            "location": "Paris",
            "publisher": "hal",
            "keywords": [
                "Hardware security",
                "Fault Injection Attacks",
                "RISC-V",
                "Physical Memory Protection",
                "Hamming code",
                "FPGA"
            ]
        },
        {
            "subject": "paper",
            "author": [
                "William PENSEC",
                "Francesco REGAZZONI",
                "Vianney LAPÔTRE",
                "Guy GOGNIAT"
            ],
            "titre": "Defending the Citadel: Fault Injection Attacks against Dynamic Information Flow Tracking and Related Countermeasures",
            "booktitle": "IEEE Computer Society Annual Symposium on VLSI",
            "acronyme": "ISLVSI 2024",
            "month": "July",
            "abstract": "Embedded processors are key components of Internet of Things (IoT) devices of Cyber-Physical Systems (CPSs) that manipulate sensitive data. In order to mitigate software attacks, hardware-assisted Dynamic Information Flow Tracking (DIFT) has been integrated into embedded processors. Due to their proximity to attackers, IoT devices are also exposed to physical attacks such as Fault Injection Attacks (FIAs). In this paper, we protect DIFT from fault injection attacks by extending current DIFT support with fault detection and correction capabilities. To do so, we design, implement and evaluate two countermeasures based on parity bit or Hamming code to protect DIFT-related registers of RISC-V CPUs. Our experimental results, obtained using the D-RI5CY processor as a use case, show a 100% fault detection and fault correction when relying on a Hamming code-based protection and a low area overhead (10.6%) compared to the original design.",
            "doi": "https://doi.org/10.1109/ISVLSI61997.2024.00042",
            "location": "Knoxville, Tennessee, USA",
            "publisher": "ieee",
            "keywords": [
                "Hardware security",
                "RISC-V",
                "DIFT",
                "Fault Injections Attacks",
                "Error-Correcting Code",
                "Countermeasures"
            ]
        },
        {
            "subject": "poster",
            "author": [
                "William PENSEC",
                "Vianney LAPÔTRE",
                "Guy GOGNIAT"
            ],
            "titre": "FISSA: Fault Injection Simulation for Security Assessment",
            "booktitle": "Journée Nationales du GDR SOC2",
            "acronyme": "GDR SOC2",
            "month": "June",
            "abstract": "This work introduces FISSA, an open-source software tool designed to simplify the creation of fault injection campaigns using popular HDL simulation tools. FISSA comprises two key modules, each encapsulating an existing HDL simulator. The first module generates TCL scripts to automate fault injection according to user specifications, while the second module facilitates fault analysis, allowing users to evaluate design's security. This approach seamlessly integrates fault injection simulations into the design workflow. To showcase FISSA's effectiveness, the paper presents a case study assessing the robustness of a Dynamic Information Flow Tracking mechanism within a RISC-V processor across fault injection scenarios.",
            "location": "Toulouse",
            "publisher": "hal",
            "doi": "https://hal.science/hal-04727380",
            "keywords": [
                "Hardware security",
                "RISC-V",
                "DIFT",
                "Fault Injections Attacks",
                "Open-Source tool",
                "Vulnerability Assessment"
            ]
        },
        {
            "subject": "poster",
            "author": [
                "William PENSEC",
                "Vianney LAPÔTRE",
                "Guy GOGNIAT"
            ],
            "titre": "Automating Fault Injection through CABA Simulation for Vulnerability Assessment",
            "booktitle": "CYBERUS Spring School",
            "acronyme": "CYBERUS",
            "month": "April",
            "abstract": "Internet of Things (IoT) devices have revolutionised data collection and analysis, yet their proximity raises concerns about physical attacks like fault injection attacks (FIA). Numerous studies have highlighted critical system vulnerabilities to FIAs. This poster presents FISSA (Fault Injection Simulation for Security Assessment), automating circuit design robustness evaluation against FIA through early-stage simulations using existing HDL simulators.",
            "location": "Lorient",
            "publisher": "hal",
            "doi": "https://hal.science/hal-04727353",
            "keywords": []
        },
        {
            "subject": "poster",
            "author": [
                "Kévin QUÉNÉHÉRVÉ",
                "William PENSEC",
                "Philippe TANGUY",
                "Vianney LAPÔTRE"
            ],
            "titre": "Characterizing Clock Glitching Attacks on CVA6 PMP Configuration Flow",
            "booktitle": "CYBERUS Spring School",
            "acronyme": "CYBERUS",
            "month": "April",
            "abstract": "",
            "location": "Lorient",
            "publisher": "hal",
            "doi": "https://hal.science/hal-04729593",
            "keywords": []
        }
        
    ],
    "2023": [
        {
            "subject": "presentation",
            "author": [
                "Vianney LAPÔTRE",
                "William PENSEC",
                "Guy GOGNIAT"
            ],
            "titre": "Protecting a RISC-V embedded processor against physical and software attacks",
            "booktitle": "BITFLIP by DGA-European Cyber Week",
            "acronyme": "BITFLIP by DGA",
            "month": "November",
            "abstract": "",
            "doi": "https://hal.science/hal-04381708/",
            "location": "Rennes",
            "publisher": "hal",
            "keywords": [
                "Processor security",
                "RISC-V",
                "Dynamic Information Flow Tracking",
                "Fault injection attacks"
            ]
        },
        {
            "subject": "paper",
            "author": [
                "William PENSEC",
                "Vianney LAPÔTRE",
                "Guy GOGNIAT"
            ],
            "titre": "Another Break in the Wall: Harnessing Fault Injection Attacks to Penetrate Software Fortresses",
            "booktitle": "Proceedings of the First International Workshop on Security and Privacy of Sensing Systems",
            "acronyme": "Sensors S&P",
            "month": "November",
            "abstract": "Internet of Things (IoT) devices manipulate sensitive data leading to strict security needs. They face both software and physical attacks due to their network connectivity and their proximity to attackers. These devices are usually built around low-cost and low-power processors. In this paper, we study the impact of Fault Injection Attacks (FIA) on Dynamic Information Flow Tracking (DIFT) mechanism of the D-RI5CY processor. Our results highlight the high sensitivity of this protection mechanism to multiple fault types at multiple spatial and temporal locations. Out of 3318 simulations, we achieved 74 successes (2.23%), mainly due to bit-flips.",
            "doi": "https://doi.org/10.1145/3628356.3630116",
            "location": "Istanbul, Turkiye",
            "publisher": "acm",
            "keywords": [
                "Hardware security",
                "DIFT",
                "RISC-V",
                "Fault injection attacks"
            ]
        },
        {
            "subject": "presentation",
            "author": [
                "William PENSEC",
                "Vianney LAPÔTRE",
                "Guy GOGNIAT"
            ],
            "titre": "Unveiling the Invisible Threads: Dynamic Information Flow Tracking and the Intriguing World of Fault Injection Attacks",
            "booktitle": "Journée thématique sur les Attaques par Injection de Fautes",
            "acronyme": "JAIF",
            "month": "September",
            "abstract": "Different software attacks, such as buffer overflow, SQL injections, and malware, can be detected using Dynamic Information Flow Tracking (DIFT) techniques. These techniques involve attaching and propagating tags to information containers at runtime, allowing for the detection of malicious behavior. The literature has explored various implementations of DIFT, including hardware, software, and hybrid approaches. Hardware DIFT solutions can be classified into two categories: off-core and in-core. This work focuses on the D-RI5CY processor, which implements an in-core DIFT. Our objective is to investigate the impact of Fault Injection Attacks (FIA) on the efficiency of the D-RI5CY DIFT mechanism. We conduct fault injection simulations to evaluate the sensitivity of the D-RI5CY DIFT and identify the hardware components related to DIFT that require protection.",
            "doi": "https://jaif.io/2023/media/JAIF2023-slides-Pensec.pdf",
            "location": "Gardanne",
            "publisher": "hal",
            "keywords": [
                "Processor security",
                "RISC-V",
                "Dynamic information flow tracking",
                "Fault injection attacks"
            ]
        },
        {
            "subject": "poster",
            "author": [
                "William PENSEC",
                "Vianney LAPÔTRE",
                "Guy GOGNIAT"
            ],
            "titre": "Unveiling the Invisible Threads: Dynamic Information Flow Tracking and the Intriguing World of Fault Injection Attacks",
            "booktitle": "Journée thématique sur les Attaques par Injection de Fautes",
            "acronyme": "JAIF",
            "month": "September",
            "abstract": "Different software attacks, such as buffer overflow, SQL injections, and malware, can be detected using Dynamic Information Flow Tracking (DIFT) techniques. These techniques involve attaching and propagating tags to information containers at runtime, allowing for the detection of malicious behavior. The literature has explored various implementations of DIFT, including hardware, software, and hybrid approaches. Hardware DIFT solutions can be classified into two categories: off-core and in-core. This work focuses on the D-RI5CY processor, which implements an in-core DIFT. Our objective is to investigate the impact of Fault Injection Attacks (FIA) on the efficiency of the D-RI5CY DIFT mechanism. We conduct fault injection simulations to evaluate the sensitivity of the D-RI5CY DIFT and identify the hardware components related to DIFT that require protection.",
            "doi": "https://hal.science/hal-04727439",
            "location": "Gardanne",
            "publisher": "hal",
            "keywords": [
                "Processor security",
                "RISC-V",
                "Dynamic information flow tracking",
                "Fault injection attacks"
            ]
        },
        {
            "subject": "presentation",
            "author": [
                "William PENSEC",
                "Vianney LAPÔTRE",
                "Guy GOGNIAT"
            ],
            "titre": "Fault Injection Attacks Against an In-Core DIFT Mechanism",
            "booktitle": "Cyberus Summer School 2023",
            "acronyme": "CYBERUS",
            "month": "July",
            "abstract": "Internet of Things (IoT) devices manipulate sensitive data leading to strict security needs. They face both software and physical attacks due to their network connectivity and their proximity to attackers. These devices are usually built around low-cost and low-power processors. In this paper, we study the impact of Fault Injection Attacks (FIA) on the D-RI5CY processor integrating a Dynamic Information Flow Tracking (DIFT) mechanism against software threats. Our results highlight the high sensitivity of the target to multiple fault types at multiple spatial and temporal locations.",
            "doi": "https://hal.science/hal-04424945",
            "location": "Lorient",
            "publisher": "hal",
            "keywords": [
                "Processor security",
                "RISC-V",
                "Dynamic Information Flow Tracking",
                "Fault injection attacks"
            ]
        },
        {
            "subject": "presentation",
            "author": [
                "Vianney LAPÔTRE",
                "William PENSEC",
                "Guy GOGNIAT"
            ],
            "titre": "When in-core Dynamic Information Flow Tracking faces fault injection attacks",
            "booktitle": "19th International Workshops on Cryptographic architectures embedded in logic devices",
            "acronyme": "CryptArchi",
            "month": "June",
            "abstract": "Both software and physical attacks are serious threats for Internet of Things (IoT) devices. Low-cost and low-power processors are usually the key component of these systems. They manipulate sensitive data leading to strict security needs. In this paper, we study the impact of Fault Injection Attacks (FIA) on protected RISC-V processor integrating a Dynamic Information Flow Tracking (DIFT) mechanism against software threats.",
            "doi": "https://hal.science/hal-04381235",
            "location": "Cantabria, Spain",
            "publisher": "hal",
            "keywords": [
                "Processor security",
                "RISC-V",
                "Dynamic Information Flow Tracking",
                "Fault injection attacks"
            ]
        },
        {
            "subject": "poster",
            "author": [
                "William PENSEC",
                "Vianney LAPÔTRE",
                "Guy GOGNIAT"
            ],
            "titre": "When in-core DIFT faces fault injection attacks",
            "booktitle": "RISC-V Summit Europe",
            "acronyme": "RISC-V Summit",
            "month": "June",
            "abstract": "Both software and physical attacks are serious threats for Internet of Things (IoT) devices. Low-cost and low-power processors are usually the key component of these systems. They manipulate sensitive data leading to strict security needs. In this paper, we study the impact of Fault Injection Attacks (FIA) on protected RISC-V processor integrating a Dynamic Information Flow Tracking (DIFT) mechanism against software threats.",
            "doi": "https://hal.science/hal-04132319v1",
            "location": "Barcelona, Spain",
            "publisher": "hal",
            "keywords": [
                "Processor security",
                "RISC-V",
                "Dynamic Information Flow Tracking",
                "Fault injection attacks"
            ]
        }
    ],
    "2022": [
        {
            "subject": "poster",
            "author": [
                "William PENSEC",
                "Vianney LAPÔTRE",
                "Guy GOGNIAT"
            ],
            "titre": "Protection of a processor with DIFT against physical attacks",
            "booktitle": "International Winter School on Microarchitectural Security",
            "acronyme": "Mic-Sec Winter School",
            "month": "December",
            "abstract": "Internet of Things (IoT) devices are spreading massively in critical infrastructures like industry, smart cities, bio-medical devices, etc. Unfortunately, they also contribute to the increase of the attack surface of information systems, which represents a significant threat. A low-cost processor is usually a key element of IoT devices. Thus, it is necessary to build protection mechanisms taking into account performances, energy consumption and area. Due to network connectivity and proximity to attackers, embedded systems face both software and physical attacks. Dynamic Information Flow Tracking (DIFT) techniques can detect various software attacks by attaching and propagating tags to information containers at runtime. The goal of this project is therefore to design and evaluate a robust DIFT protection mechanism against both software and physical attacks (side channel analysis and fault injection attacks). This work relies on an open source RISC-V processor.",
            "doi": "https://hal.science/hal-04727408v1",
            "location": "Paris",
            "publisher": "hal",
            "keywords": []
        },
        {
            "subject": "presentation",
            "author": [
                "William PENSEC",
                "Vianney LAPÔTRE",
                "Guy GOGNIAT"
            ],
            "titre": "Protection of a processor with DIFT against physical attacks",
            "booktitle": "CYBERUS",
            "acronyme": "CYBERUS",
            "month": "September",
            "abstract": "",
            "doi": "",
            "location": "Lorient",
            "publisher": "",
            "keywords": ["embedded systems", "security", "processors"]
        },
        {
            "subject": "poster",
            "author": [
                "William PENSEC",
                "Vianney LAPÔTRE",
                "Guy GOGNIAT"
            ],
            "titre": "Protection of a processor with DIFT against physical attacks",
            "booktitle": "Assemblée Générale du Pôle SHARP - Lab-STICC",
            "acronyme": "AG SHARP",
            "month": "July",
            "abstract": "Internet of Things (IoT) devices are spreading massively in critical infrastructures like industry, smart cities, bio-medical devices, etc. Unfortunately, they also contribute to the increase of the attack surface of information systems, which represents a significant threat. A low-cost processor is usually a key element of IoT devices. Thus, it is necessary to build protection mechanisms taking into account performances, energy consumption and area. Due to network connectivity and proximity to attackers, embedded systems face both software and physical attacks. Dynamic Information Flow Tracking (DIFT) techniques can detect various software attacks by attaching and propagating tags to information containers at runtime. The goal of this project is therefore to design and evaluate a robust DIFT protection mechanism against both software and physical attacks (side channel analysis and fault injection attacks). This work relies on an open source RISC-V processor.",
            "doi": "https://hal.science/hal-04727408v1",
            "location": "Brest",
            "publisher": "hal",
            "keywords": []
        },
        {
            "subject": "paper",
            "author": [
                "William PENSEC",
                "David ESPES",
                "Catherine DEZAN"
            ],
            "titre": "Smart Anomaly Detection and Monitoring of Industry 4.0 by Drones",
            "booktitle": "International Conference on Unmanned Aircraft Systems",
            "acronyme": "ICUAS",
            "month": "June",
            "abstract": "Nowadays, industry 4.0 can be distributed over a large area. To monitor their processes, they use sensors that periodically gather data on the system. Based on them, operators can detect that an anomaly occurs on the system. However, it is not always easy to know the causes of the anomaly because the operator has no visual information on the system. To help operators to identify the root of the anomaly, drones are very useful because they are fast enough to intervene in large-scale industry and embed a large variety of sensors to offer complementary data (images, video…) that are necessary for the diagnosis. However, drones have to be synchronized with the industrial process to know where the anomaly occurs and to go there in an automated way. We propose a new architecture to automate the displacement of the drone to reach safely the place where the anomaly is located and to confirm it using a deep-learning approach. The drone embeds a small computing system (Raspberry Pi) which communicates with the supervisory control and data acquisition system in order to be aware of anomalies that occur on the industrial process. To function properly indoor or outdoor, the drone is positioned either using a precise positioning system based on ultra-wide band (UWB) or on the GPS. The drone can take pictures of the potentially detected anomaly and thanks to a neural network algorithm, it analyzes the images to confirm or deny the anomaly. The results show an error on the indoor position of about 5 cm, and a precision of about 90% to detect anomalies.",
            "doi": "https://doi.org/10.1109/ICUAS54217.2022.9836057",
            "location": "Dubrovnik, Croatia",
            "publisher": "ieee",
            "keywords": [
                "Industry 4.0",
                "Java",
                "C++",
                "ModBus",
                "Raspberry Pi",
                "UWB",
                "Neural networks",
                "Computer architecture",
                "Production",
                "Sensors",
                "Fourth Industrial Revolution",
                "UAV",
                "IDS"
            ]
        }
    ]
}