{
    "2023":[
        {
            "author": [
                "W. PENSEC",
                "V. LAPÔTRE",
                "G. GOGNIAT"
            ],
            "titre": "When in-core DIFT faces fault injection attacks",
            "booktitle": "RISC-V Summit Europe",
            "acronyme": "RISC-V Summit",
            "month": "June",
            "abstract": "Both software and physical attacks are serious threats for Internet of Things (IoT) devices. Low-cost and low-power processors are usually the key component of these systems. They manipulate sensitive data leading to strict security needs. In this paper, we study the impact of Fault Injection Attacks (FIA) on protected RISC-V processor integrating a Dynamic Information Flow Tracking (DIFT) mechanism against software threats.",
            "doi": "https://hal.science/hal-04132319",
            "keywords": [
                "Processor security",
                "RISC-V",
                "Dynamic Information Flow Tracking",
                "Fault injection attacks"
            ]
        },
        {
            "author": [
                "W. PENSEC",
                "V. LAPÔTRE",
                "G. GOGNIAT"
            ],
            "titre": "Another Break in the Wall: Harnessing Fault Injection Attacks to Penetrate Software Fortresses",
            "booktitle": "Proceedings of the First International Workshop on Security and Privacy of Sensing Systems",
            "acronyme": "Sensors S&P",
            "month": "November",
            "abstract": "Internet of Things (IoT) devices manipulate sensitive data leading to strict security needs. They face both software and physical attacks due to their network connectivity and their proximity to attackers. These devices are usually built around low-cost and low-power processors. In this paper, we study the impact of Fault Injection Attacks (FIA) on Dynamic Information Flow Tracking (DIFT) mechanism of the D-RI5CY processor. Our results highlight the high sensitivity of this protection mechanism to multiple fault types at multiple spatial and temporal locations. Out of 3318 simulations, we achieved 74 successes (2.23%), mainly due to bit-flips.",
            "doi": "https://doi.org/10.1145/3628356.3630116",
            "keywords": [
                "Hardware security",
                "DIFT",
                "RISC-V",
                "Fault injection attacks"
            ]
        }
    ],
    "2022": [
        {
            "author": [
                "W. PENSEC",
                "D. ESPES",
                "C. DEZAN"
            ],
            "titre": "Smart Anomaly Detection and Monitoring of Industry 4.0 by Drones",
            "booktitle": "International Conference on Unmanned Aircraft Systems",
            "acronyme": "ICUAS",
            "month": "June",
            "abstract": "Nowadays, industry 4.0 can be distributed over a large area. To monitor their processes, they use sensors that periodically gather data on the system. Based on them, operators can detect that an anomaly occurs on the system. However, it is not always easy to know the causes of the anomaly because the operator has no visual information on the system. To help operators to identify the root of the anomaly, drones are very useful because they are fast enough to intervene in large-scale industry and embed a large variety of sensors to offer complementary data (images, video…) that are necessary for the diagnosis. However, drones have to be synchronized with the industrial process to know where the anomaly occurs and to go there in an automated way. We propose a new architecture to automate the displacement of the drone to reach safely the place where the anomaly is located and to confirm it using a deep-learning approach. The drone embeds a small computing system (Raspberry Pi) which communicates with the supervisory control and data acquisition system in order to be aware of anomalies that occur on the industrial process. To function properly indoor or outdoor, the drone is positioned either using a precise positioning system based on ultra-wide band (UWB) or on the GPS. The drone can take pictures of the potentially detected anomaly and thanks to a neural network algorithm, it analyzes the images to confirm or deny the anomaly. The results show an error on the indoor position of about 5 cm, and a precision of about 90% to detect anomalies.",
            "doi": "https://doi.org/10.1109/ICUAS54217.2022.9836057",
            "keywords": [
                "Industry 4.0",
                "Java", 
                "C++",
                "ModBus",
                "Raspberry Pi",
                "UWB",
                "Neural networks",
                "Computer architecture",
                "Production",
                "Sensors",
                "Fourth Industrial Revolution",
                "UAV",
                "IDS"
            ]
        }
    ]
}